; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	infrared2 - mode
	infrared1 - mode
	infrared3 - mode
	spectrograph0 - mode
	GroundStation0 - direction
	Star3 - direction
	GroundStation4 - direction
	Star5 - direction
	Star6 - direction
	GroundStation9 - direction
	Star10 - direction
	GroundStation12 - direction
	Star13 - direction
	GroundStation14 - direction
	Star2 - direction
	GroundStation11 - direction
	GroundStation8 - direction
	Star7 - direction
	Star1 - direction
	Star15 - direction
	Star16 - direction
	Phenomenon17 - direction
	Planet18 - direction
	Phenomenon19 - direction
	Phenomenon20 - direction
	Star21 - direction
)
(:init
	(supports instrument0 infrared1)
	(supports instrument0 spectrograph0)
	(calibration_target instrument0 Star7)
	(calibration_target instrument0 GroundStation11)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star10)
	(supports instrument1 spectrograph0)
	(supports instrument1 infrared3)
	(calibration_target instrument1 Star1)
	(calibration_target instrument1 Star7)
	(calibration_target instrument1 GroundStation8)
	(calibration_target instrument1 GroundStation11)
	(calibration_target instrument1 Star2)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon17)
)
(:goal (and
	(pointing satellite1 Star16)
	(have_image Star15 spectrograph0)
	(have_image Star16 infrared3)
	(have_image Phenomenon20 infrared1)
))

)

; plan
1. (turn_to satellite1 groundstation11 phenomenon17)
   deleted: (pointing satellite1 phenomenon17)
   added: (pointing satellite1 groundstation11)
   goals met: 0 of 4
2. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 4
3. (calibrate satellite1 instrument1 groundstation11)
   added: (calibrated instrument1)
   goals met: 0 of 4
4. (turn_to satellite1 star15 groundstation11)
   deleted: (pointing satellite1 groundstation11)
   added: (pointing satellite1 star15)
   goals met: 0 of 4
5. (turn_to satellite0 groundstation11 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 groundstation11)
   goals met: 0 of 4
6. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 4
7. (calibrate satellite0 instrument0 groundstation11)
   added: (calibrated instrument0)
   goals met: 0 of 4
8. (take_image satellite1 star15 instrument1 spectrograph0)
   added: (have_image star15 spectrograph0)
   goals met: 1 of 4
9. (turn_to satellite0 phenomenon20 groundstation11)
   deleted: (pointing satellite0 groundstation11)
   added: (pointing satellite0 phenomenon20)
   goals met: 1 of 4
10. (take_image satellite0 phenomenon20 instrument0 infrared1)
   added: (have_image phenomenon20 infrared1)
   goals met: 2 of 4
11. (turn_to satellite1 star16 star15)
   deleted: (pointing satellite1 star15)
   added: (pointing satellite1 star16)
   goals met: 3 of 4
12. (take_image satellite1 star16 instrument1 infrared3)
   added: (have_image star16 infrared3)
   goals met: 4 of 4
